[Killed] BlockStatement
Lab 4/Mutation-testing/src/advance.js:1:20
-function Pow(a, b) {
-  return a ** b;
-}
+function Pow(a, b) {}
 
 function Modulo(a, b) {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
Lab 4/Mutation-testing/src/advance.js:9:20
   return a % b;
 }
 
-function GCD(a, b) {
-  a = Math.abs(a);
-  b = Math.abs(b);
-  while (b) {
-    var temp = b;
-    b = a % b;
-    a = temp;
-  }
-  return a;
-}
+function GCD(a, b) {}
 
 // console.log(Pow(2, 3));
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Timeout] BlockStatement
Lab 4/Mutation-testing/src/advance.js:12:13
 function GCD(a, b) {
   a = Math.abs(a);
   b = Math.abs(b);
-  while (b) {
-    var temp = b;
-    b = a % b;
-    a = temp;
-  }
+  while (b) {}
   return a;
 }

[Timeout] ArithmeticOperator
Lab 4/Mutation-testing/src/advance.js:14:9
   b = Math.abs(b);
   while (b) {
     var temp = b;
-    b = a % b;
+    b = a * b;
     a = temp;
   }
