[Killed] BlockStatement
Lab 4/Mutation-testing/src/basic.js:13:23
   return a * b;
 }
 
-function divide(a, b) {
-  if (b == 0) return null;
-  else return a / b;
-}
+function divide(a, b) {}
 
 module.exports = {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.5
Received: undefined

[Killed] ConditionalExpression
Lab 4/Mutation-testing/src/basic.js:14:7
 }
 
 function divide(a, b) {
-  if (b == 0) return null;
+  if (true) return null;
   else return a / b;
 }
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.5
Received: null

[Killed] ConditionalExpression
Lab 4/Mutation-testing/src/basic.js:14:7
 }
 
 function divide(a, b) {
-  if (b == 0) return null;
+  if (false) return null;
   else return a / b;
 }
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: Infinity

[Killed] ArithmeticOperator
Lab 4/Mutation-testing/src/basic.js:15:15
 
 function divide(a, b) {
   if (b == 0) return null;
-  else return a / b;
+  else return a * b;
 }
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.5
Received: 2
